igokraj/Smart-Lock-System-STM32-AI-Gesture-Recognitio/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define w4_Pin GPIO_PIN_1
#define w4_GPIO_Port GPIOB
#define k1_Pin GPIO_PIN_2
#define k1_GPIO_Port GPIOB
#define k2_Pin GPIO_PIN_12
#define k2_GPIO_Port GPIOB
#define w1_Pin GPIO_PIN_13
#define w1_GPIO_Port GPIOB
#define w2_Pin GPIO_PIN_14
#define w2_GPIO_Port GPIOB
#define w3_Pin GPIO_PIN_15
#define w3_GPIO_Port GPIOB
#define LED_C_Pin GPIO_PIN_7
#define LED_C_GPIO_Port GPIOC
#define LED_Z_Pin GPIO_PIN_8
#define LED_Z_GPIO_Port GPIOA
#define Buzzer_Pin GPIO_PIN_9
#define Buzzer_GPIO_Port GPIOA
#define k3_Pin GPIO_PIN_11
#define k3_GPIO_Port GPIOA
#define k4_Pin GPIO_PIN_12
#define k4_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define Motion_sensor_Pin GPIO_PIN_4
#define Motion_sensor_GPIO_Port GPIOB
#define Motion_sensor_EXTI_IRQn EXTI4_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
